![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a biblioteca Pandas.\
Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.\
Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

#### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/users_dataset.txt***.\
Salve os dados em uma variável de nome *users*.

In [7]:
import pandas as pd
users = pd.read_csv("./datasets/users_dataset.csv", "|")
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

#### Tarefa 2. Descubra qual a idade média por ocupação.

*Dica: use a função groupby do Pandas na coluna occupation*

In [17]:
(users
.groupby("occupation")
.agg({"age":["mean", "std"],"user_id" : "max"}))

                     age            user_id
                    mean        std     max
occupation
administrator  38.746835  11.123397     940
artist         31.392857   8.668116     920
doctor         43.571429  12.501428     935
educator       42.010526  10.413264     937
engineer       36.388060  11.199236     934
entertainment  29.222222  10.056052     926
executive      38.718750  10.608075     901
healthcare     41.562500  11.313524     910
homemaker      32.571429  10.737119     898
lawyer         36.750000  10.830303     846
librarian      40.000000  11.023611     942
marketing      37.615385   9.474500     881
none           26.555556  13.757826     756
other          34.523810  10.738227     936
programmer     33.121212   9.624512     927
retired        63.071429   5.757461     900
salesman       35.666667  14.079859     925
scientist      35.548387   7.392964     930
student        22.081633   5.284081     943
technician     33.148148   9.867210     938
writer         36.311111  11.423306     911

#### Tarefa 3. Para cada ocupação descubra a idade mínima e máxima.

In [19]:
(users
.groupby("occupation")
.agg({"age": ["min","max"]}))

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

#### Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

Exemplo:

```
occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
```

In [23]:
(users
.groupby(["occupation", "gender"])
.agg({"age": ["mean", "min", "max"]}))

                            age
                           mean min max
occupation    gender
administrator F       40.638889  22  62
              M       37.162791  21  70
artist        F       30.307692  19  48
              M       32.333333  20  45
doctor        M       43.571429  28  64
educator      F       39.115385  23  51
              M       43.101449  25  63
engineer      F       29.500000  23  36
              M       36.600000  22  70
entertainment F       31.000000  24  38
              M       29.000000  15  50
executive     F       44.000000  39  49
              M       38.172414  22  69
healthcare    F       39.818182  22  53
              M       45.400000  28  62
homemaker     F       34.166667  20  50
              M       23.000000  23  23
lawyer        F       39.500000  28  51
              M       36.200000  21  53
librarian     F       40.000000  26  59
              M       40.000000  23  69
marketing     F       37.200000  24  50
              M       37.875000  24  55
none          F       36.500000  26  55
              M       18.600000  11  33
other         F       35.472222  18  55
              M       34.028986  13  64
programmer    F       32.166667  26  38
              M       33.216667  20  63
retired       F       70.000000  70  70
              M       62.538462  51  73
salesman      F       27.000000  18  33
              M       38.555556  21  66
scientist     F       28.333333  26  31
              M       36.321429  23  55
student       F       20.750000  13  38
              M       22.669118   7  42
technician    F       38.000000  38  38
              M       32.961538  21  55
writer        F       37.631579  18  56
              M       35.346154  21  60

#### Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres.

Exemplo:

```
occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
```

In [33]:
((users
.groupby(["occupation","gender"])
.agg({"user_id": "count"})) 
/ 
users.groupby("occupation").agg({"user_id" : "count"})) * 100

                         user_id
occupation    gender
administrator F        45.569620
              M        54.430380
artist        F        46.428571
              M        53.571429
doctor        M       100.000000
educator      F        27.368421
              M        72.631579
engineer      F         2.985075
              M        97.014925
entertainment F        11.111111
              M        88.888889
executive     F         9.375000
              M        90.625000
healthcare    F        68.750000
              M        31.250000
homemaker     F        85.714286
              M        14.285714
lawyer        F        16.666667
              M        83.333333
librarian     F        56.862745
              M        43.137255
marketing     F        38.461538
              M        61.538462
none          F        44.444444
              M        55.555556
other         F        34.285714
              M        65.714286
programmer    F         9.090909
              M        90.909091
retired       F         7.142857
              M        92.857143
salesman      F        25.000000
              M        75.000000
scientist     F         9.677419
              M        90.322581
student       F        30.612245
              M        69.387755
technician    F         3.703704
              M        96.296296
writer        F        42.222222
              M        57.777778

In [37]:
#outra maneira
users.groupby(['occupation', 'gender'])['gender'].size().groupby(level=0).apply(lambda x: 100 * x / float(x.sum())).to_frame()

                          gender
occupation    gender
administrator F        45.569620
              M        54.430380
artist        F        46.428571
              M        53.571429
doctor        M       100.000000
educator      F        27.368421
              M        72.631579
engineer      F         2.985075
              M        97.014925
entertainment F        11.111111
              M        88.888889
executive     F         9.375000
              M        90.625000
healthcare    F        68.750000
              M        31.250000
homemaker     F        85.714286
              M        14.285714
lawyer        F        16.666667
              M        83.333333
librarian     F        56.862745
              M        43.137255
marketing     F        38.461538
              M        61.538462
none          F        44.444444
              M        55.555556
other         F        34.285714
              M        65.714286
programmer    F         9.090909
              M        90.909091
retired       F         7.142857
              M        92.857143
salesman      F        25.000000
              M        75.000000
scientist     F         9.677419
              M        90.322581
student       F        30.612245
              M        69.387755
technician    F         3.703704
              M        96.296296
writer        F        42.222222
              M        57.777778

**Parabéns! Você chegou ao fim!**